In [144]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
#The Machine learning alogorithm
from sklearn.ensemble import RandomForestClassifier

# Test train split
from sklearn.model_selection import train_test_split

# Just to switch off pandas warning
pd.options.mode.chained_assignment = None

# Used to write our model to a file
from sklearn.externals import joblib

In [145]:
data = pd.read_csv("titanic_train.csv")
data.head()

,Unnamed: 0,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,998,999,3rd,1,"McCarthy, Miss Katie",NaN,NaN,NaN,NaN,NaN,NaN,female
1,179,180,1st,0,"Millet, Mr Francis Davis",65.0,Southampton,"East Bridgewater, MA",NaN,NaN,(249),male
2,556,557,2nd,0,"Sjostedt, Mr Ernst Adolf",59.0,Southampton,"Sault St Marie, ON",NaN,NaN,NaN,male
3,174,175,1st,0,"McCaffry, Mr Thomas Francis",46.0,Cherbourg,"Vancouver, BC",NaN,NaN,(292),male
4,1232,1233,3rd,0,"Strilic, Mr Ivan",NaN,NaN,NaN,NaN,NaN,NaN,male

In [146]:
data.columns

Index(['Unnamed: 0', 'row.names', 'pclass', 'survived', 'name', 'age',
       'embarked', 'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [147]:
median_age = data['age'].median()
print("Median age is {}".format(median_age))

Median age is 29.0

In [148]:
data['age'].fillna(median_age, inplace = True)
data['age'].head()

0    29.0
1    65.0
2    59.0
3    46.0
4    29.0
Name: age, dtype: float64

In [149]:
data['boat'] = data['boat'].str.replace('[^\d]*', '')
data['boat'] = pd.to_numeric(data['boat'], errors='coerce')
data['boat'].fillna(0, inplace = True)
data['boat'] = data['boat'].astype(int)

data['boat'].unique()

array([   0,  249,  292,  171,    5,    7,   15,  269,    3,   97,    4,
         57,   19,   45,   12,    1,   80,  241,  232,  283,  245,  165,
       1412,  108,    6,    8,  175,    9,    2,  263,   11,   43,  295,
        189,  166,   14,   13,   81,   79,  299,  230,   38,  234,  307,
        142,  130,  169,  101,  305,  172,  133,   10,  275,   16,  126,
         72,  297,  148,  260,  121,   22,  109,  103,  135,  147,  110,
        236,  293,  286,  124,   18,  122,  207,  190])

In [150]:
# data["pclass"].replace("3rd", 3, inplace = True)
# data["pclass"].replace("2nd", 2, inplace = True)
# data["pclass"].replace("1st", 1, inplace = True)
# data.head()

In [151]:
# var = 'boat'
# plotter =pd.concat([data['survived'], data[var]], axis=1)
# plotter.plot.scatter(x=var,y='survived', ylim= (0,800000));
# plt.show()

In [152]:
data_inputs = data[["pclass", "age", "sex", "embarked"]] #, "ticket"
data_inputs.head()

  pclass   age     sex     embarked
0    3rd  29.0  female          NaN
1    1st  65.0    male  Southampton
2    2nd  59.0    male  Southampton
3    1st  46.0    male    Cherbourg
4    3rd  29.0    male          NaN

In [153]:
expected_output = data[["survived"]]
expected_output.head()

   survived
0         1
1         0
2         0
3         0
4         0

In [154]:
data_inputs["pclass"].replace("3rd", 3, inplace = True)
data_inputs["pclass"].replace("2nd", 2, inplace = True)
data_inputs["pclass"].replace("1st", 1, inplace = True)
data_inputs.head()

   pclass   age     sex     embarked
0       3  29.0  female          NaN
1       1  65.0    male  Southampton
2       2  59.0    male  Southampton
3       1  46.0    male    Cherbourg
4       3  29.0    male          NaN

In [155]:
# var = 'age'
# plotter =pd.concat([expected_output, data_inputs[var]], axis=1)
# plotter.plot.scatter(x=var,y='survived', ylim= (0,2));
# plt.show()

In [156]:
data_inputs["sex"] = np.where(data_inputs["sex"] == "female", 0, 1)
data_inputs.head()

   pclass   age  sex     embarked
0       3  29.0    0          NaN
1       1  65.0    1  Southampton
2       2  59.0    1  Southampton
3       1  46.0    1    Cherbourg
4       3  29.0    1          NaN

In [157]:
data_inputs = pd.get_dummies(data_inputs)
data_inputs.head()

,pclass,age,sex,embarked_Cherbourg,embarked_Queenstown,embarked_Southampton
0,3,29.0,0,0,0,0
1,1,65.0,1,0,0,1
2,2,59.0,1,0,0,1
3,1,46.0,1,1,0,0
4,3,29.0,1,0,0,0

In [158]:
inputs_train, inputs_test, expected_output_train, expected_output_test   = train_test_split (data_inputs, expected_output, test_size = 0.2, random_state = 42)

print(inputs_train.head())
print(expected_output_train.head())

     pclass   age  sex  embarked_Cherbourg  embarked_Queenstown  \
456       1  49.0    1                   1                    0
796       3  29.0    1                   0                    0
25        1  48.0    1                   0                    0
84        3  29.0    1                   0                    0
10        3  24.0    1                   0                    0

     embarked_Southampton
456                     0
796                     0
25                      1
84                      0
10                      1
     survived
456         1
796         1
25          1
84          0
10          0

In [159]:
rf = RandomForestClassifier(n_estimators=9, max_depth=8)

In [160]:
rf.fit(inputs_train, expected_output_train)

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=8, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=9, n_jobs=None,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [161]:
accuracy = rf.score(inputs_test, expected_output_test)
print("Accuracy = {}%".format(accuracy * 100))

Accuracy = 88.04347826086956%

In [143]:
joblib.dump(rf, "titanic_model1", compress=9)

['titanic_model1']

In [162]:
# inputs_train['rf'] = rf.predict(inputs_train)
# inputs_test['rf'] = rf.predict(inputs_test)

# XBG

In [163]:
from xgboost import XGBClassifier
from sklearn.model_selection import GridSearchCV, cross_val_score

In [164]:
model_xgb = XGBClassifier(n_estimators=9, scale_pos_weight=0.67)# ,scale_pos_weight=0.4, max_depth=12, learning_rate=0.1
model_xgb.fit(inputs_train, expected_output_train)

/usr/local/lib/python3.7/site-packages/sklearn/preprocessing/label.py:219: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/site-packages/sklearn/preprocessing/label.py:252: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bytree=1, gamma=0, learning_rate=0.1, max_delta_step=0,
       max_depth=3, min_child_weight=1, missing=None, n_estimators=9,
       n_jobs=1, nthread=None, objective='binary:logistic', random_state=0,
       reg_alpha=0, reg_lambda=1, scale_pos_weight=0.67, seed=None,
       silent=True, subsample=1)

In [165]:
accuracy = model_xgb.score(inputs_test, expected_output_test)
print("Accuracy = {}%".format(accuracy * 100))

Accuracy = 84.23913043478261%

# Normal Stacking

In [167]:
from sklearn import model_selection
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB 
from sklearn.ensemble import RandomForestClassifier
from mlxtend.classifier import StackingCVClassifier

In [182]:
clf1 = KNeighborsClassifier(n_neighbors=1)
clf2 = RandomForestClassifier(random_state=42)
clf3 = GaussianNB()
lr = LogisticRegression()

sclf = StackingCVClassifier(classifiers=[rf, model_xgb], 
                            meta_classifier=lr)

print(inputs_train.values.shape)
print(expected_output_train.values.shape)

(735, 6)
(735, 1)

In [181]:
sclf.fit(inputs_train.values, expected_output_train.values)

/usr/local/lib/python3.7/site-packages/mlxtend/classifier/stacking_cv_classification.py:216: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(X[train_index], y[train_index])
/usr/local/lib/python3.7/site-packages/mlxtend/classifier/stacking_cv_classification.py:216: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(X[train_index], y[train_index])
/usr/local/lib/python3.7/site-packages/sklearn/preprocessing/label.py:219: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.7/site-packages/sklearn/preprocessing/label.py:252: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

ValueError: all the input arrays must have same number of dimensions